# **Chapter 5.**

# DATA Weangling

# Install libraries
install seaborn

install matplotlib.pyplot

install numpy

import pandas

In [ ]:
# Import libraries
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [ ]:
kashti=sns.load_dataset("titanic")
ks1=kashti
ks2=kashti

In [ ]:
kashti.describe

In [ ]:
kashti.columns

In [ ]:
kashti.head()

In [ ]:
# Simple mathematical operations
(kashti["age"]+12).head(10)

In [ ]:
(kashti["sex"]+" ").head(10)

In [ ]:
kashti.shape

# Dealing with missing values

#In a dataset, missing values are neither. NA, NaN, or 0 or blank cell

In [ ]:
#How to find missing values in the data.
#Data.isnull().sum(). here example is:
kashti.isnull().sum()

In [ ]:
# How to remove or drop missing value to clean the data.
  #we can use drop.na to remove the missing values.
print(kashti.shape)
kashti.dropna(subset=["deck"], axis=0, inplace=True)

  #This will remove specifically missing values or cells.
  #inplace=True modifies the dataframe.

In [ ]:
#To drop na values from whote dsataframe.
kashti=kashti.dropna()

In [ ]:
#to update the main dataframe
kashti.isnull().sum()

In [ ]:
kashti.shape

In [ ]:
ks1=sns.load_dataset("titanic")

In [ ]:
ks1.shape

In [ ]:
# Replacing of missing values by means of average of that column.
#finding mean/average of that column.
mean=ks1["age"].mean()
mean

In [ ]:
ks1["age"]=ks1["age"].replace(np.nan,mean)

In [ ]:
kas2=sns.load_dataset("titanic")

In [ ]:
ks1.isnull().sum()

In [ ]:
kas2.isnull().sum()

In [ ]:
ks2["age"]=ks2["age"].replace(np.nan, 12)

In [ ]:
ks2.isnull().sum()

In [ ]:
ks2.head(5)

In [ ]:
#How to know the data types and convert into known ones.
kashti.dtypes

In [ ]:
kashti["survived"]=kashti["survived"].astype("int64")
kashti.dtypes

In [ ]:
#How to convert age into days.
kashti["age"]=kashti["age"]*365
kashti.head()

In [ ]:
#How to rename column name?
ks1.rename(columns={"age":"age in days"},inplace=True)
ks1.head()

# Data normalization

In [ ]:
ks4=kashti[["age", "fare"]]
ks4.head()

# Methods of normalization
    - simple feature scaling.
     - X(new)= x(old)/X(max)

In [ ]:
ks4["fare"]=ks4["fare"]/ks4["fare"].max()
ks4.head()

In [ ]:
ks3=kashti[["age", "fare"]]
ks3.head()
ks3["age"]=ks3["age"]/ks3["age"].max()
ks3.head()

In [ ]:
ks3["fare"]=ks3["fare"]/ks3["fare"].max()
ks3.head()

In [ ]:
ks5=kashti[["age", "fare"]]
ks5.head()

In [ ]:
#Min-Max Methods   
ks4["fare"]=(ks4["fare"]-ks4["fare"].min()) / (ks4["fare"].max()-ks4["fare"].min())
ks4.head()

In [ ]:
#Z-score Method
ks5["fare"]=(ks5["fare"]-ks5["fare"].mean())/ks5["fare"].std()
ks5.head()

In [ ]:
ks5["age"]=(ks5["age"]-ks5["age"].mean())/ks5["age"].std()
ks5.head()

# Log transformation

In [ ]:
kashti["fare"]=np.log(ks4["fare"])
kashti.head()

In [ ]:
ks6=sns.load_dataset("titanic")
ks6.head()

In [ ]:
ks6=ks6[["fare", "age"]]
ks6.head()

In [ ]:
ks6["age"]=ks6["age"]*365
ks6.head()

In [ ]:
ks6["fare"]=np.log(ks6["fare"])
ks6.head()

In [ ]:
ks6["age"]=np.log(ks6["age"])
ks6.head()

# Binning

In [ ]:
# Coverting categorical values into dumies values.
Male,female (0,1)

In [134]:
ks=sns.load_dataset("titanic")
ks.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [135]:
dum=pd.get_dummies(ks["sex"])

In [136]:
ks.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

ks["sex"].replace(np.nan, dum)

In [138]:
pip install scipy

Requirement already satisfied: scipy in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (1.8.1)
Requirement already satisfied: numpy<1.25.0,>=1.17.3 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from scipy) (1.23.1)
WARNING: You are using pip version 22.0.4; however, version 22.2.1 is available.
You should consider upgrading via the '/usr/local/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [147]:
from scipy.stats import shapiro

In [152]:
370000*32

11840000